---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RepeatingDetailLayout
source: html/a3145465-b588-d366-da24-6f4db365d11f.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RepeatingDetailLayout Property

"Layout"

## Syntax (C#)
```csharp
public static ForgeTypeId RepeatingDetailLayout { get; }
```